{
  "allQueries": [
    {
      "date": "25 March 2025",
      "shortTitle": "(Continuation from the query submitted...",
      "category": "Architect's Practice",
      "query": "(Continuation from the query submitted on 12 March 2025 – query no 5)How and where do I get justice for fraudulent practitioner like this one. He claimed to be your member. Surely you must have a procedure for members pretending to be your member’s and etc?",
      "reply": "We refer to the following;Your initial query as received on the 12th March 2025. Our reply dated 25th March 2025.Your latest query in response to our above reply, as received on the 25th March 2025.  Based on your information dated 12 March 2025, the individual appears to be a registered Building Draughtsman. The provided business card indicates \"Pelukis Pelan Bangunan / Building Draughtman (sic)\" with a Lembaga Arkitek Malaysia (LAM) registration number, i.e. BD/xx. As previously stated in our email on 25 March 2025, Pertubuhan Akitek Malaysia (PAM) maintains only a list of its members and does not register Building Draughtsmen. Regulatory matters regarding Building Draughtsmen under the Architects Act 1967 are managed by LAM. LAM's contact details were provided in our earlier email. PAM can and does act against its members who breach our Constitution and By-laws. However, our authority does not extend beyond our membership. PAM's procedures include lodging police reports or taking legal action if there is firsthand knowledge and evidence of fraudulent use of the Institute's name or intentional harm caused to the Institute. If you have firsthand knowledge and evidence of any deception perpetrated against yourself, we advise you consider lodging a police report. If you have incurred financial loss due to a breach of any agreement with the individual, we suggest seeking legal advice to pursue damages."
    },
    {
      "date": "12 March 2025",
      "shortTitle": "The enquirer raises concerns regarding...",
      "category": "Architect's Practice",
      "query": "The enquirer raises concerns regarding former architect’s professional conduct and requests clarification on his registration status with LAM. There is uncertainty about his credentials, as his name does not appear on LAM’s website. If he misrepresented his practicing status, the enquirer seeks assistance in obtaining a full refund of RM6,000 paid for his services.Additionally, the enquirer questions the necessity of a civil engineer for a minor balcony extension, which legally does not require one, and highlights that the architect’s fees were significantly higher than the market rate.The enquirer also alleges that the architect did not adhere to prior agreements, changed his approach after receiving payment, and prioritized the planning department’s requirements over the client’s instructions. The final architectural plan did not reflect the initial discussions before payment.Furthermore, the enquirer reports being subjected to wrongful enforcement actions, including harassment over essential repairs (roof, sewage, plumbing), despite informing both the architect and local authorities that extension work had been halted. The enquirer seeks a resolution to these issues, distinguishing necessary repair work from the extension dispute.",
      "reply": "We refer to your email received on 4.51PM, 12th March 2025 and based on the information provided, please find our response below:Status of the IndividualBased on the documents and information shared, the individual in question appears to be a registered Building Draughtsman and not a Professional Architect as defined under the Architects Act 1967. Kindly note that the Pertubuhan Akitek Malaysia (PAM) only maintains records of its own members, which include architects, graduate and student architects. We do not register Building Draughtsmen, and to our knowledge, this individual is not a member of PAM.To check his LAM registration no. or verify his registration status and credentials, we recommend referring directly to Lembaga Arkitek Malaysia (LAM) via their official website at www.lam.gov.my or by contacting them at info@lam.gov.my. Scope of PAM’s AuthorityAs a professional institute, PAM is not empowered to intervene in private financial matters or assist in the claiming of refunds. If you believe that there has been a breach of agreement or misrepresentation, we recommend you address the matter directly with the individual concerned, or alternatively, seek legal advice if necessary. You may also consult with LAM for their advice.Scope of Services and Local Authority MattersAs we are unaware of the terms and conditions agreed between the building draughtsman and yourself, we are unable to comment on the specific scope of services, fees or communications between the both of you.  Any dealings or correspondence with the local authority would similarly fall outside PAM’s purview.Requirement for Structural EngineerWith respect to your query on the involvement of a civil or structural engineer, please be informed that for submission of building plans under By-law 3 of the Uniform Building (Negeri Sembilan) By-laws 1986, structural plans and calculations, in compliance of By-law 16, must be submitted prior to construction. These documents must be prepared by a registered structural engineer, regardless of the size of the proposed works. Therefore, the requirement for a structural engineer is a legal requirement and not at the discretion of the draughtsman or architect. If you have further queries on this issue, we advise you to consult the local authority."
    },
    {
      "date": "12 March 2025",
      "shortTitle": "On 22 January 2025, the...",
      "category": "Architect's Practice",
      "query": "On 22 January 2025, the enquirer made a payment of RM3,500 for \"Architectural consultancy services for submission to authority drawings and administrative work.\" The architect initially assured that he would handle all necessary approvals, including obtaining neighbour consent, before payment was made. However, after payment, the architect is now demanding an additional RM500 plus 8% SST for miscellaneous supplementary and additional services. These include transportation, client advising, site suitability assessment, addressing neighbour complaints, and previous site visits.Additionally, the architect has added RM811.40 (excluding SST) for:RM500 lump sum for supplementary/additional servicesRM136 for cukai tanah (land tax) 2025RM175.40 for cukai pintu (assessment tax) 2025Total: RM876.31 (including SST)The enquirer had asked multiple times whether updated cukai tanah and cukai pintu were required, but received no response and assumed they were not necessary since the architect had taken over from a previous professional. The enquirer argues that, due to the architect’s failure to request these documents earlier, the additional costs should not be borne by the client.Issues Raised:Failure to obtain neighbour consent as initially promised.Demand for additional charges post-payment.Lack of communication regarding additional costs and tax requirements.Delayed engagement, with the enquirer only meeting the architect in person on the third site visit.Sudden demand for extra charges after the enquirer returned to London.Requested Outcome:No additional charges beyond those officially required by a PBT.Assurance that the architect fulfils his obligations as per the original invoice without further costs.Consideration of the enquirer’s detailed extension requests in accordance with municipal bylaws.Clarification on why fees for submission to a PBT were higher than those quoted by the previous architect.The enquirer seeks intervention to ensure the architect honours the agreed scope of work and does not impose unjustified additional charges.",
      "reply": "We refer to your email received on 4.28PM, 12th March 2025.While some parts of your message are unclear, we will do our best to assist based on the information provided. Please refer to our feedback as follows:Role of PAM and LAMPertubuhan Akitek Malaysia (PAM) is a professional institute for architects, comprising registered architects, graduates, and students. PAM’s role is to support its members and the public on professional matters within the scope of our Constitution and By-Laws. However, PAM is not a regulatory authority and is not empowered to enforce the Architects Act 1967 amongst architects, nor to intervene in commercial agreements or project-specific disputes between clients and their architects.In contrast, Lembaga Arkitek Malaysia (LAM), the statutory body established under the Architects Act 1967 is the main party responsible for regulating architects and their professional conduct under the above Act. If your concern involves possible misconduct under the Act, you may refer your complaint to LAM at www.lam.gov.my.Architect’s Scope of Work and FeesAn architect’s duties and fees are based on the scope of services agreed between the client and the Architect. Any supplementary services not included in the original appointment - such as additional site visits, liaising with neighbours, or handling new requirements - may incur additional fees.Please note that government charges and disbursements, such as cukai tanah, cukai pintu, and local authority submission fees, are typically to be borne by the client, unless otherwise stated in writing.Design and Authority RequirementsWhile an architect may offer design proposals, the final approval for any extension or renovation lies with the local authority. Approval depends on compliance with current planning and building regulations. If you have concerns about what is permissible, we recommend you consulting directly with local authorities. On Complaints and Alternative Dispute Resolution (ADR)If your concern involves a dispute with your Architect, we suggest reviewing the terms of engagement to determine what services were agreed upon and what provisions exist for dispute resolution. Should you still intend lodging a complaint against one of our members for a possible breach of our constitution or by-laws, you may submit your formal complaint to complaint@pam.org.my. We hope the above has been of assistance."
    },
    {
      "date": "15 January 2025",
      "shortTitle": "My firm is facing these...",
      "category": "Architect's Practice",
      "query": "My firm is facing these two things, first item from a major agricultural company as part of the appointment requirements, while the second by a housing developer, who decided to impose that ruling when our invoice was submitted.I hope you can provide a feedback as to how to tackle these items, especially the first matter since we have been asked to submit our fee proposal taking into account the performance bond.Is it legal for clients to impose a performance bond on the architects? If it is not legal, what facts can be presented to the client to counter / prevent the enforcement of a performance bond on the architects?Can a retention sum be imposed on the architect's fees as practiced on the contractor? What facts can be presented to the client to counter said practice on architects?I thank you in advance for your kind assistance on the matter.",
      "reply": "Thank you for your enquiry dated 15 January 2025. We reply as follows: Please note that there are no provisions under the Architects Act 1967 or the Architects (Scale of Minimum Fees) Rules 2010 that mandate or regulate the imposition of a performance bond or retention sum on Architects. These practices are not customary or consistent with established norms for professional architectural services. As the terms of engagement between an Architect and a client are private and subject to mutual agreement, we advise exercising caution and seeking professional advice - legal or financial - before accepting such terms, as they may have significant implications for your practice. We trust the above has been of assistance."
    },
    {
      "date": "5 December 2024",
      "shortTitle": "Can we charge foreign company...",
      "category": "Architect's Practice",
      "query": "Can we charge foreign company who employs us in Malaysia with architect fee in USD?",
      "reply": "We refer to your enquiry as received on the 5th December 2024 and would write in reply as follows: All architectural consultancy services are required to be provided in accordance to the Architects Rules 1996 as well as the Architects (Scale of Minimum Fees) Rules (SoMF). As far as we are aware though, there are no restrictions placed by the above documents on the currency to be used for the invoicing/charging for the above services. Nevertheless, please be reminded that there are other legal and financial requirements which may need to be considered such as the imposition and declaration of service tax, the declaration of income to the Inland Revenue Board and the handling of overseas funds including their receipt and transfer for example. We would suggest that you consult your accountant and banker for advice on the above."
    },
    {
      "date": "25 November 2024",
      "shortTitle": "Would like to find out...",
      "category": "Architect's Practice",
      "query": "Would like to find out that who are the architects able to provide space planning design in cinema industry in Malaysia.Thank you.",
      "reply": "We refer to your enquiry as received on the 25th November 2024. Apart from the information provided by our members for inclusion in the PAM Directory, the Institute does not maintain a database of project types undertaken by its members. We also wish to highlight that PAM, including its Practice Bureau, adheres to a policy of impartiality and does not recommend or endorse specific architects for any projects. Therefore, we regret being unable to provide names of architectural practices specializing in space planning for the cinema industry in Malaysia. As an alternative, you may consider reaching out to cinema operators, their specialist consultants, suppliers, or contractors for recommendations. Given that cinemas are typically located in shopping malls, contacting mall developers for insights on professional consultants they’ve worked with may also be helpful. Additionally, some Malaysian architects specializing in this field have an online presence, which you might find useful to explore."
    },
    {
      "date": "23 October 2024",
      "shortTitle": "Can Majlis process submission on...",
      "category": "Architect's Practice",
      "query": "Can Majlis process submission on a same project by a new architect without a letter of release from the architect who has submitted drawings earlier.Is there any situation the Majlis can process the drawings without a letter of release.What action can we take against the new submitting person and Majlis if in the event Majlis proceed with processing the plan without the letter of release.",
      "reply": "Thank you for your enquiry dated 23rd October 2024 concerning the requirement for a Letter of Release (LOR) and actions by the local authority in cases where project submission is undertaken by a new Architect.With reference to the limited information provided in the query and guided by the LAM General Circular No. 3/2023, please find our response as follows:According to the Circular, obtaining an LOR is mandatory when a project transitions from one Architect to another. This requirement safeguards the professional responsibilities, intellectual property rights, and liabilities of the original Architect until an LOR is issued. Therefore, subject to the conditions stipulated in the Circular, an LOR must be obtained before a new Architect can submit any work on an ongoing project.However, the Circular applies solely to the conduct of LAM-registered Architects and does not impose any obligations on local authorities. There is no specific law or regulation that governs the responsibility of the local authority (LA) regarding the LOR in project submissions; thus, we are not in a position to respond to your queries concerning the actions of the LA.We recommend that the original Architect proactively inform and communicate with the LA, briefly outlining the guidelines under the Circular and requesting the LA’s guidance on handling submissions in such cases.If the original Architect has clear evidence that his/her rights have been compromised by the acceptance of a new submission without an LOR, he/she may consider filing a formal complaint with the LA, outlining the specific professional concerns involved. Where appropriate, seeking legal advice can provide further support in safeguarding the original Architect's rights and interests in this matter.Additionally, if the new submission contravenes the Circular, the original Architect may file a formal disciplinary complaint with LAM, enabling LAM to investigate and take any necessary disciplinary action against the new Architect.We hope this response provides the clarity and direction needed."
    },
    {
      "date": "30 September 2024",
      "shortTitle": "Whether there is any architect...",
      "category": "Architect's Practice",
      "query": "Whether there is any architect who is willing to assist our resident association in matters of building and traffic flow for a new building in PJ.We are a subcommittee under a Resident Association who is trying to find a solution for especially traffic flow from an up and coming new building in PJ.  We are trying to find an architect to give us pro bono advise against the developer and the city council on what can or cannot be done.",
      "reply": "Thank you for your enquiry, received on 30th September 2024. We understand that your subcommittee, under the Resident Association, was seeking advice regarding traffic flow concerns related to a new development in PJ and exploring the possibility of obtaining pro bono architectural advice.As the query provided was brief and lacked supporting details, we will offer general guidance based on the available information.Firstly, it is important to note that the Malaysian Institute of Architects (Pertubuhan Akitek Malaysia, or PAM) is a private institute representing architects in Malaysia. While PAM is committed to supporting community efforts, we are not in a position to recommend specific architects or consultants for individual projects, whether pro bono or paid.Should your subcommittee wish to engage architectural services, we advise you to refer to the list of registered architects available through Lembaga Arkitek Malaysia (LAM), the statutory body responsible for regulating the architectural profession in Malaysia. This will ensure you work with architects who are properly accredited and qualified.In relation to pro bono services, it is important to note that such services are generally intended for individuals or groups facing financial hardship, as outlined by LAM’s guidelines. We recommend consulting LAM to determine whether pro bono architectural services would be appropriate in your case.Lastly, we suggest maintaining open communication with your local city council, as they hold authority over development matters, including traffic management. The city council is best positioned to provide insights on compliance with local traffic regulations and to advise on potential mitigation measures. Through these discussions, your subcommittee will gain a clearer understanding of the issues at hand and be able to determine the appropriate type of consultant or advisor for your objectives.We hope this information proves helpful and wish you success in addressing the concerns raised."
    },
    {
      "date": "13 May 2024",
      "shortTitle": "My company is about to...",
      "category": "Architect's Practice",
      "query": "My company is about to engage an Architect to design an industrial building for us, complete with local authority submissions.I would like to enquire as to whether all Architects in Malaysia are required to be registered and have professional indemnity Insurance?Also, what are the general requirements for engagement?",
      "reply": "We refer to your email dated 13 May 2024. Our response is as follows:According to Section 7(a) of the Architects Act 1967, only an architect who is registered with the Board of Architects Malaysia (LAM) is entitled to render architectural consultancy services. Therefore, in response to your inquiry, all architects are required to be registered in Malaysia.Regarding professional indemnity insurance, it is not mandatory for architects in Malaysia. It is optional and depends on the project’s requirements and the agreement between the architect and their employer.All Architects are required to always abide by the Architects Act 1967 (Act 117) and Architects Rules made under the Act in providing their architectural services and it is mandatory under the Act for the appointment of an Architect to be made in accordance with the Third Schedule of Architects Rules 1996 – Conditions of Engagement of an Architect. You may refer to the Architects Act 1967 and the Architects (Scale of Minimum Fees) Rules 2010 for further details via the Lembaga Arkitek Malaysia’s website: https://lam.gov.my/download-act-rules. Hope this is helpful to you."
    },
    {
      "date": "21 April 2025",
      "shortTitle": "(Continuation from query submitted on...",
      "category": "Building Control",
      "query": "(Continuation from query submitted on 9 April 2025)Thank you for your response dated 21.4.2025, which I have noted with appreciation.Regarding the “falsified survey plan,” I confirm that I reported this issue, supported by relevant drawings, to the Sabah Surveyors Board over two years ago. Additionally, I have lodged a complaint with the Board of Architects Malaysia (LAM), which is currently under investigation.I understand that your response is provided as general clarification. In this context, I have one general question: Is the amended development plan typically prepared before or after the completion of the final as-built survey?",
      "reply": ""
    },
    {
      "date": "9 April 2025",
      "shortTitle": "Sir, is an architect as...",
      "category": "Building Control",
      "query": "Sir, is an architect as the Principal Submitting Person responsible for submitting a falsified as-built survey, given tohim by the surveyor, to the authorities, DBKK?I am writing to seek clarification regarding the responsibilities of architects under the building regulations applicable in Sabah in 2019, particularly in relation to the Occupancy Certificate (OC) issued for Project A on October 2, 2019. The building regulations in Sabah at that time - likely the Sabah Building By-Laws 1964 or its amendments - governed the process, outlining architects’ responsibilities in plan submission and compliance certification. These by-laws were tailored to Sabah’s local context but shared similarities with the Uniform Building By-Laws 1984 in terms of professional duties.  In your email to me dated 14.10.2022, you stated, ‘We have also been led to understand that there is a current, legal dispute between yourself and the Developer. Apart from not being able to comment based on the information we have received, we hope you understand that we are also unable to add any further advice lest it may be misconstrued as interference within the above-mentioned dispute.’Now that there is no legal dispute, I hope you will please help me with my predicament.Under the building by-laws in Sabah in 2019, architects were required to:  Submit and obtain approval for building plans.  Supervise construction to ensure compliance with approved plans and structural integrity.  Certify compliance during construction stages, contributing to the issuance of an Occupancy Certificate (OC) by the local authority, as was the practice in Sabah at that time.The PAM Contract 2018 complements these by-laws by outlining the architect’s contractual duties, such as monitoring progress, issuing certificates, and ensuring the works align with contract documents. An architect certifying the setting out of a building under the PAM Contract 2018 would declare, to the best of their knowledge and belief, that the works comply with approved plans, accepting responsibility for this certification.  In the case of Project A, XYZ Architect, who I understand acted as the Principal Submitting Person (PSP), claims they are not responsible for submitting a falsified survey plan to the authorities. I find this difficult to accept, as it raises questions about professional accountability under Sabah’s regulatory framework at the time.  Under the building by-laws in Sabah in 2019 (e.g., Sabah Building By-Laws 1964 or its amendments), the PSP - typically the architect - was responsible for submitting building plans to the local authority for approval, ensuring compliance with legal and technical standards. This includes verifying that accompanying documents, such as survey plans, structural drawings, and site plans, meet regulatory requirements. While the survey plan itself is typically prepared by a licensed land surveyor, the architect, as PSP, integrates it into the building plans and submits it as part of the approval process, implicitly endorsing its integrity.  If the survey plan was falsified, the architect’s claim of non-responsibility hinges on whether they knowingly submitted false information or failed to exercise due diligence. The building by-laws in Sabah in 2019 imposed a duty on the PSP to ensure that submitted plans, including survey plans, complied with regulatory standards and were accurate to the best of their knowledge. Submitting a falsified survey plan - whether intentionally or negligently - could breach this duty.  Furthermore, the Architects Act 1967 (Act 117), enforced by the Board of Architects Malaysia (LAM) and applicable across Malaysia, including Sabah, requires architects to uphold professional standards. Submitting falsified documents - directly or indirectly - could violate LAM’s Code of Professional Conduct, particularly provisions on integrity and competence.  XYZ Architect argues they relied on the surveyor’s expertise. However, courts and professional bodies often hold PSPs accountable for reasonable due diligence. Ignorance or blind reliance on others is rarely a complete defense. As PSP, they are not merely a conduit for passing documents to the authorities; they are gatekeepers of compliance. Submitting a falsified survey plan - whether they prepared it or not - falls within their sphere of oversight. The building by-laws in Sabah in 2019 and LAM’s standards suggest that architects cannot fully absolve themselves by pointing fingers at others, especially without evidence of due diligence. If the falsification was blatant or detectable, their failure to flag it undermines their professional duty.  I would appreciate PAM’s guidance on this matter, particularly whether an architect acting as PSP in 2019 could reasonably disclaim responsibility for a falsified survey plan submitted under their oversight.",
      "reply": "We refer to your query dated 9 April 2025 regarding the responsibilities of the Principal Submitting Person (PSP), in particular in relation to the issuance of the Occupancy Certificate (OC) for the project you have mentioned, and the submission of related plans under the applicable building by-laws in Sabah at the time. We provide the following feedback: Role of the PSP and Regulatory FrameworkUnder the regulatory framework in force in Sabah in 2019, a PSP—typically a registered architect—was responsible for submitting the requisite building plans and documents to the local authority in accordance with the statutory requirements then in effect. The OC, however, is issued at the discretion of the local authority upon satisfaction of applicable conditions and submission of relevant certifications. Coordination with Other ProfessionalsIt is standard industry practice for PSPs to coordinate the submission of documents prepared by other qualified professionals, such as engineers and licensed land surveyors. The PSP relies in good faith on the competency and statutory responsibility of these professionals for the content and accuracy of their respective documents. Allegation of Falsified Survey PlanWe note your reference to a “falsified survey plan.” As this is a serious allegation and no documentary evidence was enclosed, we are not in a position to comment on the specifics of the matter.Should you have concerns regarding the authenticity or accuracy of a survey plan, we recommend that you consider referring the matter to the Sabah Surveyors Board, which is the relevant authority overseeing the practice of licensed surveyors in Sabah. Scope of PAM’s RolePAM is a professional institute with the role of supporting and advancing the architectural profession. We are not a regulatory, investigative, or disciplinary body, and do not adjudicate specific complaints or disputes. Our response is intended as a general clarification only and should not be construed as legal advice or comment on any specific case. On Lodging a ComplaintShould you believe a professional duty has been breached and you have been directly affected, a formal complaint may be submitted to the relevant authority, supported with documentary evidence. Please note that regulatory processes typically require the complainant to demonstrate that they are the directly affected party or to substantiate the claim with credible documentation. We trust the above provides general clarification. For any further action, we recommend engaging with the appropriate authorities and, where necessary, seeking independent professional or legal advice."
    },
    {
      "date": "23 November 2024",
      "shortTitle": "Queries in whether performing water...",
      "category": "Building Control",
      "query": "Queries in whether performing water ponding test with supervise by Architect or his/her qualified representative to the Project ABC before issue for CCC since the master bathroom toilet leakage may cause collapse of ceiling at floor below and injure to the owner. The case repeated after 1 year first rectification (as informed from contractor by used grouting). As what I know the water proofing should have at least 5 years warranty. I wish it can have permanent solution as there are quite a lot of residence here facing the same issue and complaint to Maintenance team.",
      "reply": "We refer to your email dated 25th November 2024 and have outlined the following points for your consideration based on the information provided: Water Ponding TestA water ponding test is a widely recognized method for verifying the effectiveness of waterproofing systems in buildings. However, it is not mandatory under Malaysian laws or regulations, nor is it explicitly required for the issuance of a Certificate of Completion and Compliance (CCC). The Architect’s role concerning the CCC is primarily to certify that the Works were supervised and constructed in compliance with the Approved Plans. Supervision of the Water Ponding TestThe water ponding test is typically included in the project's technical specifications, which form part of the construction contract. This document details the methodology, scope, and responsibilities, including identifying key personnel overseeing the test. Waterproofing WarrantyWaterproofing warranties are an industry practice, not a legal requirement. The terms and conditions of such warranties are usually determined at the discretion of the Developer, Architect, or other specifiers, depending on the project needs. If no specific warranty is provided, the Defects Liability Period (DLP) in the Sale and Purchase Agreement (SPA) will apply. We advise reaching out to the Developer for clarification on any waterproofing warranty applicable to your case. Rectification of DefectsIf the DLP is still valid, we advise contacting the Developer to address the defects. Refer to Clause 30 of the SPA, which outlines your rights during the DLP. Should defects persist after the DLP has expired, you may consider seeking legal advice or filing a claim with the Tribunal for Homebuyer’s Claims under the Ministry of Housing and Local Government (KPKT). Maintenance ConsiderationsBuilding materials, including waterproofing systems, are subject to wear and tear. While no waterproofing solution is permanent, regular monitoring and maintenance are essential to minimize issues over time. We trust the above has been of assistance."
    },
    {
      "date": "6 November 2024",
      "shortTitle": "The purchaser would like to...",
      "category": "Building Control",
      "query": "The purchaser would like to inform the management of Developer A that we are not happy and very unsatisfied with the finished unit that was handed over to us. This is due to multiple design failures and other defects as mentioned below. There are multiple design issues / failures.We believe that substandard materials were used.Material specification and actual design specifications the architect was not provided to buyers. Why? Defects - mostly completed via superficial/ artificial/ temporary solution - with very high chances of recurring defects within 6 months to 1 years’ time. We are seeking / asking and demanding for a joint inspection together with the Developer, Contractor, Architect, MDBK (Jabatan Perancangan) and a senior member from Malaysian Institute of Architects . We will not agree to a joint inspection on the defect rectification, if any of the mentioned parties do not participate. We believe that all parties must take responsibility and join this session.Issues and response from Developer (numbers) and Buyer (Point form)The type of door used for all of the rooms is High Density Fibre with High Moisture Resistance (HDF-HMR). To date we have rectified all defective doors in your unit.Please share the specifications of the door that was used in our units? Kindly share the documents (purchase of door materials - specifications) to ensure the correct type of materials was used.This is a serious design failure - Please indicate where in the UBBL. Where does it state that you can build in this manner? I have gone through the UBBL and can't find any specific clause regarding this. What design was submitted to MDBK. We are also not sure how MDBK approved this design? Did MDBK visit any of the units? If so, when did they visit and what was the conclusion of the visit?  The type of material used for the piping systems. For the water main it is HDPE pipes in accordance with Air Selangor Klang requirements. From tapping to the water meter, stainless steel pipe is used. From the water meter to the storage tank and to all the outlets the material used is HDPE pipe. All material used is in compliance with SPAN.Kindly share the documents (purchase of materials - specifications) to ensure the correct type of materials was used.Kindly share the documents (Air Selangor Klang requirements).Kindly share the documents (SPAN - requirements).How do we check if the correct materials were used? We have rectified the water pressure issue. Our team re-tested the outlets again on 25 October 2024 and there is no longer a problem with the water pressure. (Please refer to the videos in attachment A to C).On 27th October 2024 - We found there is still insufficient water pressure. (Refer Picture and video)The pressure from the main to the kitchen pipe is very slow. The pressure from the tank is very poor at the master bedroom bathroom.The pressure from the tank is very bad to all the other outlets.Propose to invite Air Selangor (SPAN) for a site visit together with Developer and Buyers - If everything is in order then there is no reason for SPAN to decline a joint site visit right?  On the flood mitigation pond, we will respond once our Civil and Structural Engineer revert to us. We will try to respond within 7 days.This issue must be resolved ASAP. How to prevent mosquitoes from laying eggs in the flood mitigation pond?Who will be responsible for cleaning the mitigation pond? or to ensure no mosquitoes enter and lay eggs? If KKM issues a fine/ instructs further actions (mortify/ change) - who will be responsible? This issue has the potential to be dragged on and it involves KKM and other government bodies. There is now water supply to the garden outlet as it has been rectified.We did not find any pipes or outlets for the garden area? Please share the pictures - showing pipes were installed.On the bathrooms, it is designed in compliance with Uniform Building By-Law (UBBL) and in accordance with the approved building plan by Majlis Bandaraya Di Raja Klang. As per our contractual obligation in the SPA we will rectify any defective or faulty doors.From my picture - The water from the shower will touch the door in the bathroom? Will the door in the bathrooms be damaged from the shower water/ splashing? (matter of time)Your side (Contractor/ Developer) will change the damaged doors (for the duration of the defect period) correct? What will happen if the door is damaged by water splashing from the shower after the defect period?  This is a serious design failure - Needs urgent rectification/ solution.As a practicing safety and health officer, I am familiar with UBBL. Please indicate where in the UBBL does it state that you can build in this manner? I have gone through the UBBL and can't find any specific clause regarding this.We are also not sure how MDBK approved this design? Did MDBK visit any of the units upon completion? If so, when did they visit and what was the conclusion of the visit?  Did they detect any failures? Where is the report? We inspected the car porch and did not detect any sinking. Perhaps you can demarcate or indicate the area of the car porch in which you observe the sinking to enable us to inspect and rectify if required.We will demarcate and indicate the area of the car porch that is showing signs of sinking/ water ponding.We have had discussions with majority of the buyers of XXX Residences and we found that, all the buyers have the same issues as mentioned below.Car Porch sinking/ water pondingInsufficient water pressure Reappearing cracks (walls and slabs)Electrical - improper connection (major tripping/ no supply) - No power supply to the power points in the hall and ground floor room. Electrical - current coming from the earth and life wire at the same time - causing tripping.",
      "reply": "We refer to the enquiry form received on 6th November 2024. It seems that the list of questions was intended for a developer, with no specific enquiries directed to the PAM Practice Bureau (PB). Nonetheless, based on the information provided, we wish to offer our responses as follows: Direct Engagement with the DeveloperWe noted your engagement with the developer and advise that you continue to address any defects, ensuring that all necessary rectifications are completed within the Defects Liability Period (DLP). Should you require further documentation or clarification on specific defects, we recommend formally requesting this information from the developer in writing. Independent Inspection OptionIf you have concerns about the adequacy of the developer's response to defects or if you prefer an independent assessment, we recommend engaging a qualified and independent professional to inspect the units. Should you encounter difficulty in identifying such a professional, you may consider contacting Architect Centre Sdn Bhd (www.architectcentre.com.my), who could assist you with the inspection process. Tribunal for Homebuyer’s ClaimsIf your property is governed by the standard Sales and Purchase Agreement under the Housing Development (Control and Licensing) Act 1966 (Act 118) &amp; Regulations (HDA), you can file a complaint with the Tribunal for Homebuyer Claims under the Ministry of Housing and Local Government (KPKT) if the developer fails to address defects adequately. This tribunal offers an efficient, cost-effective platform for resolving property defect disputes.Request for Joint Inspection In response to your request for a joint inspection involving the Developer, Architect, Contractor, Local Authority, and a senior representative from the Malaysian Institute of Architects (PAM): please note that PAM is a private institute of architects in Malaysia. It does not possess statutory powers of enforcement and therefore would have no legal standing to attend any joint inspections requested by yourself, the developer, architect, or local authority. Local Authority ComplianceWe regret to inform you that we cannot offer guidance regarding the local authority's stance on compliance with design regulations or approvals. For precise information on design compliance or other regulatory concerns, we recommend contacting the appropriate local authority directly. We trust the above has been of assistance."
    },
    {
      "date": "29 October 2024",
      "shortTitle": "I, a resident at Project...",
      "category": "Building Control",
      "query": "I, a resident at Project ABC, located at Kuala Lumpur would like to seek your assistance in the investigation on the integrity of our building.  This past Sunday, 20 October 2024, a piece of our facade wall had fallen off the 10th floor landing near the basement entrance. Luck would have it that this incident happened at 3:30am resulting in no fatalities or injuries. In addition the facade walls, we have also been having issues with the water heater wiring catching fire. This has been on-going for months and we have yet to receive any feedback from the developer on how to mitigate or any intentions to rectify the matter.  This issue begs to question the integrity of the remaining structure. The developer is in the midst of repair works however as residents, we would like to request for a formal investigation to be conducted on the facade.  I have attached herewith a few photographs of the incident. We hope that your esteemed establishment would be able to help us bring justice.",
      "reply": "Thank you for your inquiry dated 29th October 2024. We have noted the safety concerns you raised regarding your residence. Please be informed that the PAM and its Practice Bureau are focused on providing feedback on practice-related inquiries and do not offer inspection or investigative services related to building integrity. Nevertheless, below is our feedback on the issues highlighted in your inquiry based on the limited information provided: If your residence is still within the Defects Liability Period (DLP) under the Sales and Purchase Agreement (SPA), we recommend reviewing your entitlements as per the DLP provisions. It may also be beneficial to consult a legal advisor to understand your rights under the SPA. Nevertheless, we advise that you continue engaging with the Building Manager and Developer to ensure that all lines of communication are maintained. We acknowledge the records you attached regarding balcony glass issues, burnt power sockets, and delaminated wall finishes. Given the potential safety risks, we recommend engaging an independent professional inspection service to conduct a thorough assessment. Should you have difficulty in finding such a service and require assistance in locating a qualified inspector, you may consider contacting Architect Centre Sdn Bhd (https://www.architectcentre.com.my/ or Cik Naza Izana at 019-399 4869), who may be able to assist in providing such a service. In summary, seeking advice from both a legal advisor and a qualified professional can provide clarity on your rights and guide you on the appropriate steps to address these concerns effectively. We hope this information has been helpful."
    },
    {
      "date": "4 July 2024",
      "shortTitle": "Clarification on the Eligibility of...",
      "category": "Building Control",
      "query": "Clarification on the Eligibility of Peninsular Malaysia-based ECPs to Perform Authority Submissions in Sabah and Sarawak.",
      "reply": "We refer to your enquiry received on 4th July 2024. Based on the information provided, please find our response below:Your query pertains to whether an Engineering Consultancy Practice (ECP) with a registered office in Peninsular Malaysia can carry out Authority Submissions in Sabah or Sarawak. Generally, all submitting persons must be registered with the relevant state authorities to practice and make submissions in Sabah and Sarawak. Each state has unique regulations and registration requirements, which may include provisions for temporary or special registration. We recommend consulting with the relevant state authorities in Sabah and Sarawak to understand the specific registration processes and requirements for engineers.Besides, we suggest inquiring with the respective state's immigration authorities regarding the requirement for obtaining a work permit. This permit is essential to comply with Sabah's or Sarawak's immigration regulations, ensuring legal authorisation for employment within these states.We also advise contacting the state governments, local councils, and local branches of the Board of Engineers Malaysia (BEM) and/or the Association of Consulting Engineers Malaysia (ACEM) to obtain accurate and up-to-date information tailored to your specific situation.We acknowledge that a similar query has been directed to the Board of Engineers Malaysia. We trust that your due diligence will be supported by the response from the Board of Engineers Malaysia, providing valuable and informative guidance on this matter.We hope the above information has been of assistance."
    },
    {
      "date": "6 June 2024",
      "shortTitle": "One of the owners for...",
      "category": "Building Control",
      "query": "One of the owners for a YYY condominium unit situated in Cheras, Selangor, developed by XXX Bhd. Recently, there is an uproar from the group of owners in regards to an official statement shared by YYY project's architect firm, ZZZ Architect Sdn Bhd to address the vastly discovered hollow tiles across the residential units.I have attached the official statement from ZZZ Architect Sdn Bhd, which claims that tile hollowness is not considered a defect, aiming to shield the developer from providing any sort of rectification works for the group of owners.Since most of the owners are commoners and have no in-depth knowledge in this matter, we hope to seek for PAM's view in regards to the official statement shared by these professional architects. In layman's understanding, hollow tiles are definitely a defect for us. Thank you in advance.",
      "reply": "We refer to your request for our opinion as received on 6 June 2024:When the Architect in question and yourselves refer to \"tile hollowness\", we shall assume that what is meant is the presence of a hollow or drumming sound when the surface of the tile is tapped. The above can occur for several reasons including but not limited to:Entrapped air or voids in either the setting bed or slab below, causing one part of the floor to sound differently than another;Possible separation of the waterproofing membranes installed between a slab and the bedding material;Possible vaulting of the tile due to a lack of room for expansion;The shrinking of the tile bedding as it dries out. We are of the opinion though that generally, a tiled surface is meant to:provide an aesthetically acceptable surface;allow for the drainage of water or moisture; assist in preventing the penetration of water into the underlying wall and floor;provide a surface which allows for safe habitation and passage;provide sufficient support for the activities for which the space is designed for.If the tiling is able to achieve the above, the Architect's view that \"A hollow sounding tile may not mean that the tile is defective and needs to be replaced\" is not incorrect. Nevertheless, depending on the severity of the hollow sound relative to the tiled surface, this may be indicative of the possibility of insufficient support or adhesion below the tile; insufficient support or adhesion may result in the possible cracking of the tile when it is stressed/when a load is imposed upon it or the tile coming loose or falling off. An elevated probability of tiling becoming defective is not the same though as the tiling being defective.  It must also be noted though, that the cracking or coming loose of tiles may also occur even when there is no hollow sound detected. Should you have any reservations on the ability of your tiling to perform to accepted standards, we suggest that a qualified and independent professional be engaged inspect the tiles. Should you have difficulty in finding such a professional, you may consider contacting Architect Centre Sdn Bhd (https://www.architectcentre.com.my/) as they may be of assistance in providing such a service.We hope this clarifies the situation and assists you in taking the necessary steps to address your concerns."
    },
    {
      "date": "4 January 2024",
      "shortTitle": "Project 9 blocks of Service...",
      "category": "Building Control",
      "query": "Project 9 blocks of Service Apartment Block sitting on 4 level car parks podiums and 2 levels of sub basement consist of 1800 units.Phase 1 - 1000 units with clubhouse &amp; swimming pool andother facilities.Phase 2 - 800 units with swimming pool and other facilities. Both Phases are under 1 master land title and governed by HDA.Current status:Phase 1 - 1000 unit (with all required car parking lots), all facilities - Building Plan Approved with clear demarcation of boundary by Local Authority.Phase 2 - 800 unit (with all required car parking lots), all facilities -- Building Plan Approved with clear demarcation of boundary by Local Authority.Developer has applied 2 separate Advertising Permit (Phase 1 &amp; 2), pending approval. Developer intended to launch Phase 1 first and phase 2 will be 1 year after that with different completion date. My question is for Phase 1, after all the works has been completed and complied to Approved Building Plan as perPhase 1, can architect issue Borang F for this phase 1 instead of Borang F1?",
      "reply": "We refer to your e-mail with regards to the Certificate of Completion and Compliance. As we have no details regarding the project title of your project submission, we assume the project is submitted under one (1) building plan. According to Street Drainage Building Act, Section 70 (21), the principal submitting person (PSP) is required to supervise the erection of the building to ensure that the erection is in conformity with the approved plans and other requirements.In this case, the approved building plan is only one (1) submission even though there are two (2) phases. Since there is only one (1) Building Plan, only one (1) CCC can be issued out. As such, we are of the opinion that CCC (Certificate of Completion and Compliance) or Borang F cannot be issued unless the whole project is completed. Further to this, Housing Development Act Section 3 clearly stated Certificate of Completion and Compliance for housing development does not include Partial certificate of completion and compliance(Form F1). Therefore, issuance of Form F1 for phase 1 will not help the developer to issue vacant possession earlier if he wishes to do so.A proficient resolution to address this matter involves pursuing an amendment to the building plan, thereby bifurcating the project into two phases and corresponding building plans. We recommend initiating communication with the relevant authority to seek clarification on the submission process and associated details. We hope the above reply to your query is satisfactory."
    },
    {
      "date": "5 April 2025",
      "shortTitle": "Re: Inquiry as to avenues...",
      "category": "Contract Administration",
      "query": "Re: Inquiry as to avenues to redress unfairness of developer after obtaining sign-off from architect despite remaining unresolved defects.We would like to appeal to your good self, to help us understand so as to resolve a dispute between us (as purchasers of XYZ Residensi) and Company ABC as developers of the said property.We purchased and fully paid for the said property in July, 2023. The Sales and Purchase agreement that was signed, stipulated rectification of defects will be completed by the developer within 30 days from when such defects were reported. Subsequently, we reported defects found to Company ABC but defect rectifications were delayed for a number of reasons. It is now, more than one and a half years later, there are defects still unaddressed by Company ABC.We were given committed completion dates no less than a dozen times, but each time, Company ABC failed to deliver. There were also many instances where rectification work performed were not done properly requiring multiple reworks. The pattern of commit/ delays/ non-delivery/ recommit/ rescinded commitment went on and on for close to one and a half years causing us great anguish, inconvenience and financial cost. We have full transcripts of our conversations (both e-mails and the official CRM WhatsApp chat) with Company ABC’s Customer Relationship Management (CRM) team that can attest to our claims above and available upon request.Recently, after an extended period of defect rectification works, we received a letter dated 22nd, Jan 2025 from Company ABC, stating that quote:“All rectification works have been completed in full compliancewith industry standards and verified as fully completed by theappointed Architect. Please find attached the sign off defect lists from the Architect for your reference. This letter serves as our final communication on this matter. Please be advised that no further complaints, inquiries, or correspondence regarding this issue will be entertained.”However, we have come across defects that were:- Not rectified properly.- Not rectified as per previously agreed.- Not rectified at all- Partially rectified.This is not the first time where we received such notificationfrom the developer, citing and providing a copy of the Architect’s sign off. However, as you can see from the attached chronological series of communications between us and the CRM, defects remain unresolved after the architect sign off. Why did the architect sign off the same thing multiple times and why did he/she sign off when the developer acknowledges that defects remain unresolved? Rectification works continued into January 2025.Also, on our insistence, a ponding test was conducted by Company ABC personnel on the three bathrooms after some floor tiles were changed. The test did not complete successfully with water levels in sections of all three bathrooms dropping significantly after 24 hours. Company ABC’s staff’s explanation of evaporation and absorption by the grouting for the drop in water level was totally unacceptable and proven wrong by the fact that the water levels in some other sections of the bathrooms remains high and the volume of water level drop was large. The architect was also not present at this ponding test at any time. We received no report nor notification on the results of the ponding test but Company ABC insists that all works were completed and signed off. How did the architect sign off without being present at the test initiation nor conclusion?Company ABC has cited PAM practice note No. 4-2022 as an excuse to use the architect sign-off to force defect closure. We do not feel that this is fair, nor do we believe that the spirit and intention of the cited PAM practice note is to allow for developers to bully and strong-arm purchasers to accepting sub-standard work.Our request for a meeting to discuss this matter with Company ABC and the architect has not had any response. Company ABC cites the architect’s sign off and the architect’s response when contacted for clarification was that we have no right to talk to them. This merry go round of shirking responsibility has put us in a quandary.Because of this, we are putting in this complaint to PAM to find understanding and address the unfairness of the situation to us as consumers/purchasers.We humbly request for feedback from PAM to discuss, clarifyand understand the situation. Thank you for your kind assistance in this matter.",
      "reply": "Thank you for your inquiry dated 5 April 2025 regarding defect rectification and the architect’s certification at your property. We provide our feedback as follows: Rights under the Sales and Purchase Agreement (SPA)As a copy of the Sales and Purchase Agreement (SPA) was not attached to your query, and based on publicly available information indicating that XYZ Residensi is a high-rise stratified residential development, we assume that the standard Schedule H under the Housing Development (Control and Licensing) Regulations applies. Pursuant to Clause 30 of the SPA, which prescribes timelines and actions for various parties, the Developer is required to rectify any reported defects within 30 days upon receiving written notice from the Purchaser. Should the Developer fail to do so, the Purchaser may appoint a third party to perform the necessary repairs and recover the cost from the retention sum held by the stakeholder. Clause 30(2) further stipulates that the Developer’s architect must certify that the defects have been remedied before the release of the retention.However, this certification does not override your right to dispute unresolved or unsatisfactory rectification works. You are advised to consult your solicitor for further advice based on the specific terms of your SPA.If your property is still within the Defect Liability Period, you retain the right to continue exercising the provisions under Clause 30 to ensure your notices are properly recorded. PAM Practice Note 4/2022This Practice Note provides professional guidance to architects on managing defect rectification procedures. It is not a legal document and does not carry authority to limit or override the rights of purchasers under the SPA. Dispute Resolution OptionsIf the issue remains unresolved, you may consider lodging a claim with the Tribunal for Homebuyer Claims under the Ministry of Housing and Local Government (KPKT), which addresses disputes related to housing defects and allows claims up to RM50,000. For further information, please refer to the official website of KPKT at https://www.kpkt.gov.my/index.php/pages/view/320.  Independent Inspection and SupportYou may wish to appoint a qualified independent building inspector to assess the outstanding defects. A professional inspection report may help substantiate your position in the claim. Should you need assistance in locating a qualified inspector, you may consider contacting Architect Centre Sdn Bhd (https://www.architectcentre.com.my/ or Cik Naza Izana at 019-399 4869). We hope the above clarifies your concerns. Thank you."
    },
    {
      "date": "3 February 2025",
      "shortTitle": "Project: Perlantikan Kontraktor Penyelamat Dan...",
      "category": "Contract Administration",
      "query": "Project: Perlantikan Kontraktor Penyelamat Dan Penyiap Bagi Cadangan Skim Perumahan untuk Tetuan ABC.Kontrak:Standard Form of Design and Build Contract, PWD Form DB (Rev. 1/2010)Keadaan semasa:Projek ini telah melewati  tempoh kontrak selama 3 tahun. CCC dan CPC amat diperlukan segera.Soalan:Perkara-perkara yang membolehkan CCC dan CPC dikeluarkan walaupun kerja masih belum siap dan belum sempurna.CPC dikeluarkan oleh pihak arkitek atau?CPC perlu di keluarkan dahulu kemudian CCC atau CCC kemudian CPC? Sekian, Terima Kasih.",
      "reply": "We refer to your queries regarding the completion of work under the \"Standard Form of Design and Build Contract PWD Form DB (Rev. 1/2010)\", as we received on the 3rd February 2025. As far as we are aware, all the stipulations for the \"Completion of the Works\" including;the definition of practical completion as well as the requirements for such completion;details of the parties empowered to issue Certificates of Practical Completion (CPC) and;the issuance of the CPC relative to that of the Certificate of Completion and Compliance (CCC), are all already contained within the above Standard Form.Nevertheless, we note that there may be additional conditions which may be imposed within the rest of your Contract Documents and we would as such, advise that you refer to the above Standard Form as well as your Contract Documents for the information you require."
    },
    {
      "date": "4 December 2024",
      "shortTitle": "Good afternoon.We are an architectural...",
      "category": "Contract Administration",
      "query": "Good afternoon.We are an architectural practice engaged to provide theming and theming related designs for The Developer, working together with the submitting architect, to provide a themed waterpark. As such, for our last two payment, the client has delayed payment of which our latest invoice was sent on the 5th February 2024 which till now is pending. We would like to give notice to suspend our services but there is no provisions in our LOA for such course of action. In our notice, can we refer to the Architects Rules 1996 for the suspension of services?Also, are there panel lawyers that PAM can refer us to that are familiar with contract and construction laws related to construction?Thank you for your kind attention to the matter.",
      "reply": "Thank you for your enquiry dated 4 December 2024. We would write in reply as follows:Based on your very brief description of the services provided by yourself, we are unable to ascertain if the services provided fall under the ambit of architectural consultancy services as defined under the Architects (Scale of Minimum Fees) Rules (SoMF) and as such, whether your appointment would be subject to the SoMF as well as the Conditions of Engagement as prescribed under the Architects Rules 1996 (Third Schedule). We would advise that you refer again to the services under your Letter of Appointment relative to those under the SoMF for further guidance. Should the services offered by yourselves fall under the definition of architectural consultancy services under the SoMF, please be reminded that it is mandatory that these services are provided wholly in accordance with the SoMF (Rule 29, Architects Rules 1996) and would note that the suspension of services is allowed for under the above Conditions of Engagement. Apart from outlining the procedure for the suspension of services, these Conditions also have provisions for the resolution of any disputes which may arise (including those related to the payment of fees). In addition to the provisions under the Conditions of Engagement, you may also want to consider other legal avenues (i.e.; such as those provided under the Construction Industry Payment and Adjudication Act (CIPAA)) to resolve any disputes you may have regarding your fees. PAM unfortunately, does not have any panels of lawyers or consultants to which members may refer to. We would advise that you check with your peers, colleagues and/or legal advisors for any recommendations."
    },
    {
      "date": "21 November 2024",
      "shortTitle": "I am writing to seek...",
      "category": "Contract Administration",
      "query": "I am writing to seek guidance regarding defects encountered in a commercial office strata development administered under the PAM Contract 2006. Two specific incidents have raised questions about obligations and liabilities, and I would appreciate clarification on the following matters:First Incident - Consequential Damage Due to Non-Compliance with DrawingsDuring the Defects Liability Period (DLP), the roof gutter failed during heavy rain, causing flooding to the unit owner A's renovated interior space. Upon investigation, it has been confirmed that the roof gutter was not constructed in accordance with the drawings issued by the Architect. Following an instruction issued by the Architect under Clause 15.5 to make good defects, the contractor rectified the defect. However, the furniture and interior items in the unit were damaged as a result of the leakage. The amount received from the JMB's insurance company does not cover the amount claimed by the unit owner, as a significant portion of the claim relates to consequential losses from the water damage.Question: Who is obligated to bear the costs of all consequential damages resulting from such defects? Is the contractor responsible for damages that extend beyond the direct costs of rectifying the defective work?Second Incident - Further Leakage Detected (Post-DLP)Following the expiration of the DLP and before the issuance of the Certificate of Making Good Defects (CMGD), a second leakage in the same unit A was detected in the roof gutter. Upon inspection, it has been determined that this defect also arises from the incorrect construction of the roof gutter and constitutes a latent defect as defined under Clause 15.5 of the PAM Contract 2006. To resolve the issue urgently and permanently, we intend to engage a third-party contractor to rectify the defect in accordance with Clause 30.4 of the PAM Contract 2006. Under this clause, the Employer is entitled to employ others to carry out the rectification works if the contractor fails to do so, and to recover the costs incurred from the contractor by way of set-off from payments due to the contractor.Question: As the DLP has expired, can we proceed to engage a third-party specialist to rectify this latent defect and recover the associated costs from the original contractor?",
      "reply": "We refer to your email dated 25th November 2024, based on the information provided, please refer to our feedback as follows: Consequential Losses and PAM Contract 2006The PAM Contract 2006 does not address claims for consequential losses from defects. Such claims are usually pursued between the purchaser and developer through tort. The developer may also consult their legal advisor to pursue any claims against the Contractor. Roof Gutter Failure and DefectsYou mentioned that leaks after the Defect Liability Period (DLP) were due to incorrect installation, calling it a latent defect. Correct gutter installation should have been inspected at Practical Completion and identified as a patent defect if non-compliant. It is prudent to support your claim of a latent defect. Note that \"latent defect\" is not defined under Clause 15.5 of the PAM Contract 2006. Contractor’s Obligation for DefectsClause 15.4 of the PAM Contract 2006 requires the contractor to rectify defects listed in the Schedule of Defects (SOD) after the DLP. If defects are not noted in the SOD, the Contractor may not need to rectify them. Detailed review of Clause 15 is recommended for more information on processes and limitations. Note that clauses 15.3, 15.4, and 15.5 allow hiring others to correct defects within the DLP and recovering costs under clause 30.4. However, employing others to rectify defects noted after the DLP and recovering those costs is beyond the provisions of the PAM Contract 2006. We recommend that you consult with your senior colleagues or the principal in charge regarding the matter, as they possess the necessary knowledge and have a better understanding of the context related to your query."
    },
    {
      "date": "15 November 2024",
      "shortTitle": "Merujuk kepada perkara di atas,...",
      "category": "Contract Administration",
      "query": "Merujuk kepada perkara di atas, pihak kami senaraikan permasalahan berikut:Jenis Kontrak:Condition of Contract for Design and Build Contract PWD Form DB (Rev.1/2010).Situasi:Pihak Pemaju:Bercadang mendapatkan Certicate of Completion and Compliance (CCC) sebelum Certificate of Practical Completion (CPC).Adakah ia dibolehkan dan pihak kami memerlukan rujukan (klausa) bagi perkara ini.Bercadang untuk membawa Non-Compliances Report (NCR) dicatit sebagai “Defect” dan melaksanakan pembaikan pada Defect Liability Period (DLP) disebabkan tekanan terhadap pembeli dan pelbagai pihak tertinggi.Kami memerlukan nasihat dan pandangan terhadap cadangan ini.Pihak Konsultan:Tiada bayaran fi (tambahan) kepada pihak konsultan bagi kos dan kerja-kerja semasa tamatnya tempoh kontrak atau Extension of Time (EOT) selama 4 tahun (Oktober 2021 – September 2024).Pihak kami memerlukan rujukan dan klausa berkaitan bagi mengukuhkan tuntutan kami.Bercadang menahan pengeluaran CCC sehingga pihak pemaju dan kontraktor menyelesaikan tuntutan pembayaran.Adakah terdapat cara lain selain menahan CCC bagi menuntut bayaran tersebut.",
      "reply": "We refer to your queries as received by email on the 15th November 2024. Based on the limited information provided, kindly note the following:-Completion of the Works ClauseThere are notable differences in the certification process for completion across various types of building contracts, such as design-and-build and lump sum contracts. It is advisable to review the specific conditions of each contract to understand their requirements. Non-Compliance ReportsBy \"Non-Compliance Reports\" (NCR), we understand this to mean reports identifying works that the contractor has not yet complied with or completed prior to achieving Practical Completion. Since the Defects Liability Period (DLP) commences only after Practical Completion, it is unclear how NCRs would be applicable or function during the DLP as mentioned in your query.Architect’s FeesAn architect's fees are governed by the terms of their appointment. As we are not aware of the specifics of your appointment, we recommend referring to your agreement for guidance on Additional Professional Fees for services rendered post-contract or during any delays. Payment of Professional FeesThe payment of professional fees, aligned with the stages of work completed, is typically governed by the architect's appointment terms. For any concerns about the suspension or withholding of services, we advise reviewing the relevant clauses in your appointment document.All architects are required to be fully aware of their conditions of appointment and the responsibilities that come with it. As very little information has been provided to us, we are loath to volunteer any assumptions to help you understand your responsibilities and would strongly advise that you study your own appointment/ Consultancy Agreement carefully to assist yourself in arriving at a resolution."
    },
    {
      "date": "5 November 2024",
      "shortTitle": "We cannot agree on the...",
      "category": "Contract Administration",
      "query": "We cannot agree on the amount of fees for work done. We are looking at arbitration as the way out.Please advise how to kickstart the process. And appreciate your information on duration to settle the process.",
      "reply": "We refer to your query received on 5th November 2024 regarding the initiation of the arbitration process between an Architect and his Employer, and we would like to write to note the following: As a fellow professional, you may be aware that managing fee-related matters, including arbitration if needed, generally falls within contractual and professional responsibilities. These procedures are typically outlined in the initial agreement or, where relevant, within the LAM Conditions of Engagement. For added clarity, we recommend consulting with legal counsel to confirm the best approach. While PAM does not maintain records or specific details on arbitration timelines between architects and clients, we understand that the duration can vary depending on factors such as the complexity of the dispute and the commitment and expertise of the parties involved, including the arbitrator. The PAM Practice Bureau is here to assist with general inquiries related to professional practice. However, it remains important to consider the unique aspects of your appointment and to apply your professional judgment in navigating this process."
    },
    {
      "date": "9 July 2024",
      "shortTitle": "Request for Advice on Dispute...",
      "category": "Contract Administration",
      "query": "Request for Advice on Dispute Between AI and Variation Order.",
      "reply": "We refer to your enquiry received on 9th July 2024 regarding the dispute between the Architect’s Instruction (AI) and the Variation Order (VO).Based on the limited information provided, we shall reply with reference to the PAM Contract 2018 (With Quantities) as follows:Validation of Clause 11.2In accordance with Clause 2.1 of the PAM Contract 2018, the Contractor is obligated to fully comply with any Architect's Instruction (AI) issued. This compliance extends to the provisions of a Variation Order (VO) under Clause 11.2, stating that “Pending the valuation of the Variations, the Contractor shall carry out with due diligence and expedition all Variations so instructed.” The clauses expressly state that the Contractor shall proceed with the Variation prior to the completion of the valuation.Protection Against Quotation AdjustmentsWe recommend that the Contractor adhere strictly to the Conditions of Contract. To substantiate a Variation, the Contractor must submit detailed and comprehensive records and documentation of costs incurred to the Quantity Surveyor (QS) and the Architect upon completion of the Variation works. Valuation for such Variation will be carried out by the QS in accordance with the Valuation Rules under Clause 11.6, which stipulates valuation methods based on various scenarios.Recognizing the potential for additional expenses caused by Variation works, the PAM Contract 2018 mandates that the Contractor notify the Architect within the timeframe and procedures specified in Clause 11.7 for any Variation works requiring additional expenses not covered under the Valuation Rules in Clause 11.6.Best PracticesIt is crucial for the Contractor to strictly adhere to the Conditions of Contract as a whole. Relevant clauses in the Contract specify the required documentation, submission procedures, and the timeline for dealing with Variations. Therefore, the Contractor should maintain detailed records and complete documentation, and act accordingly for the valuation of Variations."
    },
    {
      "date": "14 June 2024",
      "shortTitle": "Developer has different opinion in...",
      "category": "Contract Administration",
      "query": "Developer has different opinion in the stump definition inSchedule of Payment of 2(a) in S&amp;P agreement as per attached Sketch 1. I hope PAM can give better clarification in order for accurate certification.",
      "reply": "We refer to your enquiry as received by e-mail on the 14th June 2024. Kindly note the following:  From your attachment, it would seem that your enquiry is based on the Lembaga Arkitek Malaysia's General Circular No. 2/2017 which provides guidelines for the certification of stage completion for housing under Sale and Purchase Agreements (SPAs) provided for under the Housing Development (Control and Licensing) Regulations 1989. Based on the above, we would normally advise that you consult the Architect in charge as;all Architects should have the required knowledge and an understanding of the context to ascertain completion of any of the relevant stages; andregardless of any differences of opinion between the Architect and his Employer or fellow consultants, they are the party responsible for stage certification under the afore-mentioned SPAs.  We note though that we have encountered definitions which describe the column stump as the connecting structural component from the top of a pile cap or footing to the top of the ground beam. Nevertheless, it is our opinion that any definition should be taken within the context of the above General Circular and the stages contained under the Third Schedule of the above SPAs.  For the stages in the Third Schedule, there is a clear differentiation between;\"The foundation of the said Building\" (Stage 2(a)) and \"The structural framework of the said Building\" (Stage 2(b))The above-mentioned General Circular further elaborates by noting that;for Stage 2(a), this includes \"All foundation works below the lowest floor level\" inclusive of any stumps;for Stage 2(b), this includes \"All primary structural elements above lowest floor level (sic.)\" including beams.In reading the above, it is our opinion that;any structural element below the lowest floor level; i.e., pile caps, footings or stumps, would be considered as part of the foundations and be under stage 2(a);any structural element starting from the lowest floor level such as the ground beams would in turn, be considered as part of the structural framework under stage 2(b);following on from the above and with regards to the portion coloured red in \"Case 1\" of your attached Sketch 1, it is our considered opinion that the structural engineer should provide advice and justification based on the scope of work described, considering the nature of the structural elements in relation to their function and the overall structural system. The above should also be considered with respect to best practices when undertaking construction; would the portion coloured red in \"Case 1\" be cast together with the pile cap or would it be constructed together with the surrounding ground beams? Although the PAM Practice Bureau is willing to stand by its opinions, PAM is unfortunately not in a position to provide any official clarification on this issue as we are neither the authors of the afore-mentioned SPAs or General Circular nor are we the bodies tasked with enforcing these documents. Should you require a more conclusive answer, we would suggest you contact the Ministry of Housing and Local Government and the Lembaga Arkitek Malaysia with your enquiry.  Finally, we would also note that although the above General Circular provides \"Guidelines\" which all Architects are expected to follow, these Guidelines do not provide the same level of finality which may be found under primary legislation (such as the Housing Development (Control and Licensing) Act or secondary legislation (such as the Housing Development (Control and Licensing) Regulations.  We trust the above has been of assistance."
    },
    {
      "date": "13 March 2024",
      "shortTitle": "Last year we have terminated...",
      "category": "Contract Administration",
      "query": "Last year we have terminated the main contractor due to their non performance. During termination partly of the works has been constructed by the main contractor i.e; some of foundations works and partly structure works. We had appointed a new main contractor to resume and complete the works. The issue who should sign the G forms? The new main contractor reluctant to sign the G1-G4 forms with reason the are not the one who construct the works from the early. Whilst the previous main contractor also deny to sign since they are not completing the works.Can the G1-G4 forms signed by 2 different main contractor?",
      "reply": "Thank you for your inquiry dated 13th Mar 2024. Your query pertains to 1) the party responsible for the signing of the G1-G4 forms and 2) if the above forms may be signed by two distinct contractors for the project. Taking your first query, kindly note that the G Forms are for certification upon completion of specific works/tasks; it would follow as such, that they are required to be signed by the parties completing the relevant works/tasks. As for the second query, as far as we are aware, there are no provisions for the division of responsibility for a specific task under the above G forms to more than one party unless such division of the work has been clearly indicated on the approved Building Plan. Considering the termination of the previous main contractor and the involvement of a new contractor, we would suggest consulting with the local authority on the requirements of G forms for works involving old and new contractors.With regards to the Contractors' reluctance to sign any of the forms, we would advise that you refer to your Notice of Determination (Old Contractor), Letters of Award, Conditions of Contract and Contract Documents to check if any provisions have been made with respect to the contractors' certification under the relevant forms. You may also want to check with your Architect or Contract Administrator for clarification as they should be familiar with all of the above documents.  For works which have commenced under one main contractor but are required to be completed by another, it is normal practice for the second contractor to be selected not just on his competence and pricing but also on his agreement to accept responsibility for all the relevant works. You may want to review the award to your second contractor to confirm this. We would advise the Employer to discuss with the new Contractor on the terms and conditions which may be acceptable for him to accept the responsibilities attached to the relevant G forms. We hope this information is helpful to you."
    }
  ],
  "top10": [
    {
      "date": "25 March 2025",
      "shortTitle": "(Continuation from the query submitted...",
      "category": "Architect's Practice",
      "query": "(Continuation from the query submitted on 12 March 2025 – query no 5)How and where do I get justice for fraudulent practitioner like this one. He claimed to be your member. Surely you must have a procedure for members pretending to be your member’s and etc?",
      "reply": "We refer to the following;Your initial query as received on the 12th March 2025. Our reply dated 25th March 2025.Your latest query in response to our above reply, as received on the 25th March 2025.  Based on your information dated 12 March 2025, the individual appears to be a registered Building Draughtsman. The provided business card indicates \"Pelukis Pelan Bangunan / Building Draughtman (sic)\" with a Lembaga Arkitek Malaysia (LAM) registration number, i.e. BD/xx. As previously stated in our email on 25 March 2025, Pertubuhan Akitek Malaysia (PAM) maintains only a list of its members and does not register Building Draughtsmen. Regulatory matters regarding Building Draughtsmen under the Architects Act 1967 are managed by LAM. LAM's contact details were provided in our earlier email. PAM can and does act against its members who breach our Constitution and By-laws. However, our authority does not extend beyond our membership. PAM's procedures include lodging police reports or taking legal action if there is firsthand knowledge and evidence of fraudulent use of the Institute's name or intentional harm caused to the Institute. If you have firsthand knowledge and evidence of any deception perpetrated against yourself, we advise you consider lodging a police report. If you have incurred financial loss due to a breach of any agreement with the individual, we suggest seeking legal advice to pursue damages."
    },
    {
      "date": "12 March 2025",
      "shortTitle": "The enquirer raises concerns regarding...",
      "category": "Architect's Practice",
      "query": "The enquirer raises concerns regarding former architect’s professional conduct and requests clarification on his registration status with LAM. There is uncertainty about his credentials, as his name does not appear on LAM’s website. If he misrepresented his practicing status, the enquirer seeks assistance in obtaining a full refund of RM6,000 paid for his services.Additionally, the enquirer questions the necessity of a civil engineer for a minor balcony extension, which legally does not require one, and highlights that the architect’s fees were significantly higher than the market rate.The enquirer also alleges that the architect did not adhere to prior agreements, changed his approach after receiving payment, and prioritized the planning department’s requirements over the client’s instructions. The final architectural plan did not reflect the initial discussions before payment.Furthermore, the enquirer reports being subjected to wrongful enforcement actions, including harassment over essential repairs (roof, sewage, plumbing), despite informing both the architect and local authorities that extension work had been halted. The enquirer seeks a resolution to these issues, distinguishing necessary repair work from the extension dispute.",
      "reply": "We refer to your email received on 4.51PM, 12th March 2025 and based on the information provided, please find our response below:Status of the IndividualBased on the documents and information shared, the individual in question appears to be a registered Building Draughtsman and not a Professional Architect as defined under the Architects Act 1967. Kindly note that the Pertubuhan Akitek Malaysia (PAM) only maintains records of its own members, which include architects, graduate and student architects. We do not register Building Draughtsmen, and to our knowledge, this individual is not a member of PAM.To check his LAM registration no. or verify his registration status and credentials, we recommend referring directly to Lembaga Arkitek Malaysia (LAM) via their official website at www.lam.gov.my or by contacting them at info@lam.gov.my. Scope of PAM’s AuthorityAs a professional institute, PAM is not empowered to intervene in private financial matters or assist in the claiming of refunds. If you believe that there has been a breach of agreement or misrepresentation, we recommend you address the matter directly with the individual concerned, or alternatively, seek legal advice if necessary. You may also consult with LAM for their advice.Scope of Services and Local Authority MattersAs we are unaware of the terms and conditions agreed between the building draughtsman and yourself, we are unable to comment on the specific scope of services, fees or communications between the both of you.  Any dealings or correspondence with the local authority would similarly fall outside PAM’s purview.Requirement for Structural EngineerWith respect to your query on the involvement of a civil or structural engineer, please be informed that for submission of building plans under By-law 3 of the Uniform Building (Negeri Sembilan) By-laws 1986, structural plans and calculations, in compliance of By-law 16, must be submitted prior to construction. These documents must be prepared by a registered structural engineer, regardless of the size of the proposed works. Therefore, the requirement for a structural engineer is a legal requirement and not at the discretion of the draughtsman or architect. If you have further queries on this issue, we advise you to consult the local authority."
    },
    {
      "date": "12 March 2025",
      "shortTitle": "On 22 January 2025, the...",
      "category": "Architect's Practice",
      "query": "On 22 January 2025, the enquirer made a payment of RM3,500 for \"Architectural consultancy services for submission to authority drawings and administrative work.\" The architect initially assured that he would handle all necessary approvals, including obtaining neighbour consent, before payment was made. However, after payment, the architect is now demanding an additional RM500 plus 8% SST for miscellaneous supplementary and additional services. These include transportation, client advising, site suitability assessment, addressing neighbour complaints, and previous site visits.Additionally, the architect has added RM811.40 (excluding SST) for:RM500 lump sum for supplementary/additional servicesRM136 for cukai tanah (land tax) 2025RM175.40 for cukai pintu (assessment tax) 2025Total: RM876.31 (including SST)The enquirer had asked multiple times whether updated cukai tanah and cukai pintu were required, but received no response and assumed they were not necessary since the architect had taken over from a previous professional. The enquirer argues that, due to the architect’s failure to request these documents earlier, the additional costs should not be borne by the client.Issues Raised:Failure to obtain neighbour consent as initially promised.Demand for additional charges post-payment.Lack of communication regarding additional costs and tax requirements.Delayed engagement, with the enquirer only meeting the architect in person on the third site visit.Sudden demand for extra charges after the enquirer returned to London.Requested Outcome:No additional charges beyond those officially required by a PBT.Assurance that the architect fulfils his obligations as per the original invoice without further costs.Consideration of the enquirer’s detailed extension requests in accordance with municipal bylaws.Clarification on why fees for submission to a PBT were higher than those quoted by the previous architect.The enquirer seeks intervention to ensure the architect honours the agreed scope of work and does not impose unjustified additional charges.",
      "reply": "We refer to your email received on 4.28PM, 12th March 2025.While some parts of your message are unclear, we will do our best to assist based on the information provided. Please refer to our feedback as follows:Role of PAM and LAMPertubuhan Akitek Malaysia (PAM) is a professional institute for architects, comprising registered architects, graduates, and students. PAM’s role is to support its members and the public on professional matters within the scope of our Constitution and By-Laws. However, PAM is not a regulatory authority and is not empowered to enforce the Architects Act 1967 amongst architects, nor to intervene in commercial agreements or project-specific disputes between clients and their architects.In contrast, Lembaga Arkitek Malaysia (LAM), the statutory body established under the Architects Act 1967 is the main party responsible for regulating architects and their professional conduct under the above Act. If your concern involves possible misconduct under the Act, you may refer your complaint to LAM at www.lam.gov.my.Architect’s Scope of Work and FeesAn architect’s duties and fees are based on the scope of services agreed between the client and the Architect. Any supplementary services not included in the original appointment - such as additional site visits, liaising with neighbours, or handling new requirements - may incur additional fees.Please note that government charges and disbursements, such as cukai tanah, cukai pintu, and local authority submission fees, are typically to be borne by the client, unless otherwise stated in writing.Design and Authority RequirementsWhile an architect may offer design proposals, the final approval for any extension or renovation lies with the local authority. Approval depends on compliance with current planning and building regulations. If you have concerns about what is permissible, we recommend you consulting directly with local authorities. On Complaints and Alternative Dispute Resolution (ADR)If your concern involves a dispute with your Architect, we suggest reviewing the terms of engagement to determine what services were agreed upon and what provisions exist for dispute resolution. Should you still intend lodging a complaint against one of our members for a possible breach of our constitution or by-laws, you may submit your formal complaint to complaint@pam.org.my. We hope the above has been of assistance."
    },
    {
      "date": "15 January 2025",
      "shortTitle": "My firm is facing these...",
      "category": "Architect's Practice",
      "query": "My firm is facing these two things, first item from a major agricultural company as part of the appointment requirements, while the second by a housing developer, who decided to impose that ruling when our invoice was submitted.I hope you can provide a feedback as to how to tackle these items, especially the first matter since we have been asked to submit our fee proposal taking into account the performance bond.Is it legal for clients to impose a performance bond on the architects? If it is not legal, what facts can be presented to the client to counter / prevent the enforcement of a performance bond on the architects?Can a retention sum be imposed on the architect's fees as practiced on the contractor? What facts can be presented to the client to counter said practice on architects?I thank you in advance for your kind assistance on the matter.",
      "reply": "Thank you for your enquiry dated 15 January 2025. We reply as follows: Please note that there are no provisions under the Architects Act 1967 or the Architects (Scale of Minimum Fees) Rules 2010 that mandate or regulate the imposition of a performance bond or retention sum on Architects. These practices are not customary or consistent with established norms for professional architectural services. As the terms of engagement between an Architect and a client are private and subject to mutual agreement, we advise exercising caution and seeking professional advice - legal or financial - before accepting such terms, as they may have significant implications for your practice. We trust the above has been of assistance."
    },
    {
      "date": "5 December 2024",
      "shortTitle": "Can we charge foreign company...",
      "category": "Architect's Practice",
      "query": "Can we charge foreign company who employs us in Malaysia with architect fee in USD?",
      "reply": "We refer to your enquiry as received on the 5th December 2024 and would write in reply as follows: All architectural consultancy services are required to be provided in accordance to the Architects Rules 1996 as well as the Architects (Scale of Minimum Fees) Rules (SoMF). As far as we are aware though, there are no restrictions placed by the above documents on the currency to be used for the invoicing/charging for the above services. Nevertheless, please be reminded that there are other legal and financial requirements which may need to be considered such as the imposition and declaration of service tax, the declaration of income to the Inland Revenue Board and the handling of overseas funds including their receipt and transfer for example. We would suggest that you consult your accountant and banker for advice on the above."
    },
    {
      "date": "25 November 2024",
      "shortTitle": "Would like to find out...",
      "category": "Architect's Practice",
      "query": "Would like to find out that who are the architects able to provide space planning design in cinema industry in Malaysia.Thank you.",
      "reply": "We refer to your enquiry as received on the 25th November 2024. Apart from the information provided by our members for inclusion in the PAM Directory, the Institute does not maintain a database of project types undertaken by its members. We also wish to highlight that PAM, including its Practice Bureau, adheres to a policy of impartiality and does not recommend or endorse specific architects for any projects. Therefore, we regret being unable to provide names of architectural practices specializing in space planning for the cinema industry in Malaysia. As an alternative, you may consider reaching out to cinema operators, their specialist consultants, suppliers, or contractors for recommendations. Given that cinemas are typically located in shopping malls, contacting mall developers for insights on professional consultants they’ve worked with may also be helpful. Additionally, some Malaysian architects specializing in this field have an online presence, which you might find useful to explore."
    },
    {
      "date": "23 October 2024",
      "shortTitle": "Can Majlis process submission on...",
      "category": "Architect's Practice",
      "query": "Can Majlis process submission on a same project by a new architect without a letter of release from the architect who has submitted drawings earlier.Is there any situation the Majlis can process the drawings without a letter of release.What action can we take against the new submitting person and Majlis if in the event Majlis proceed with processing the plan without the letter of release.",
      "reply": "Thank you for your enquiry dated 23rd October 2024 concerning the requirement for a Letter of Release (LOR) and actions by the local authority in cases where project submission is undertaken by a new Architect.With reference to the limited information provided in the query and guided by the LAM General Circular No. 3/2023, please find our response as follows:According to the Circular, obtaining an LOR is mandatory when a project transitions from one Architect to another. This requirement safeguards the professional responsibilities, intellectual property rights, and liabilities of the original Architect until an LOR is issued. Therefore, subject to the conditions stipulated in the Circular, an LOR must be obtained before a new Architect can submit any work on an ongoing project.However, the Circular applies solely to the conduct of LAM-registered Architects and does not impose any obligations on local authorities. There is no specific law or regulation that governs the responsibility of the local authority (LA) regarding the LOR in project submissions; thus, we are not in a position to respond to your queries concerning the actions of the LA.We recommend that the original Architect proactively inform and communicate with the LA, briefly outlining the guidelines under the Circular and requesting the LA’s guidance on handling submissions in such cases.If the original Architect has clear evidence that his/her rights have been compromised by the acceptance of a new submission without an LOR, he/she may consider filing a formal complaint with the LA, outlining the specific professional concerns involved. Where appropriate, seeking legal advice can provide further support in safeguarding the original Architect's rights and interests in this matter.Additionally, if the new submission contravenes the Circular, the original Architect may file a formal disciplinary complaint with LAM, enabling LAM to investigate and take any necessary disciplinary action against the new Architect.We hope this response provides the clarity and direction needed."
    },
    {
      "date": "30 September 2024",
      "shortTitle": "Whether there is any architect...",
      "category": "Architect's Practice",
      "query": "Whether there is any architect who is willing to assist our resident association in matters of building and traffic flow for a new building in PJ.We are a subcommittee under a Resident Association who is trying to find a solution for especially traffic flow from an up and coming new building in PJ.  We are trying to find an architect to give us pro bono advise against the developer and the city council on what can or cannot be done.",
      "reply": "Thank you for your enquiry, received on 30th September 2024. We understand that your subcommittee, under the Resident Association, was seeking advice regarding traffic flow concerns related to a new development in PJ and exploring the possibility of obtaining pro bono architectural advice.As the query provided was brief and lacked supporting details, we will offer general guidance based on the available information.Firstly, it is important to note that the Malaysian Institute of Architects (Pertubuhan Akitek Malaysia, or PAM) is a private institute representing architects in Malaysia. While PAM is committed to supporting community efforts, we are not in a position to recommend specific architects or consultants for individual projects, whether pro bono or paid.Should your subcommittee wish to engage architectural services, we advise you to refer to the list of registered architects available through Lembaga Arkitek Malaysia (LAM), the statutory body responsible for regulating the architectural profession in Malaysia. This will ensure you work with architects who are properly accredited and qualified.In relation to pro bono services, it is important to note that such services are generally intended for individuals or groups facing financial hardship, as outlined by LAM’s guidelines. We recommend consulting LAM to determine whether pro bono architectural services would be appropriate in your case.Lastly, we suggest maintaining open communication with your local city council, as they hold authority over development matters, including traffic management. The city council is best positioned to provide insights on compliance with local traffic regulations and to advise on potential mitigation measures. Through these discussions, your subcommittee will gain a clearer understanding of the issues at hand and be able to determine the appropriate type of consultant or advisor for your objectives.We hope this information proves helpful and wish you success in addressing the concerns raised."
    },
    {
      "date": "13 May 2024",
      "shortTitle": "My company is about to...",
      "category": "Architect's Practice",
      "query": "My company is about to engage an Architect to design an industrial building for us, complete with local authority submissions.I would like to enquire as to whether all Architects in Malaysia are required to be registered and have professional indemnity Insurance?Also, what are the general requirements for engagement?",
      "reply": "We refer to your email dated 13 May 2024. Our response is as follows:According to Section 7(a) of the Architects Act 1967, only an architect who is registered with the Board of Architects Malaysia (LAM) is entitled to render architectural consultancy services. Therefore, in response to your inquiry, all architects are required to be registered in Malaysia.Regarding professional indemnity insurance, it is not mandatory for architects in Malaysia. It is optional and depends on the project’s requirements and the agreement between the architect and their employer.All Architects are required to always abide by the Architects Act 1967 (Act 117) and Architects Rules made under the Act in providing their architectural services and it is mandatory under the Act for the appointment of an Architect to be made in accordance with the Third Schedule of Architects Rules 1996 – Conditions of Engagement of an Architect. You may refer to the Architects Act 1967 and the Architects (Scale of Minimum Fees) Rules 2010 for further details via the Lembaga Arkitek Malaysia’s website: https://lam.gov.my/download-act-rules. Hope this is helpful to you."
    },
    {
      "date": "21 April 2025",
      "shortTitle": "(Continuation from query submitted on...",
      "category": "Building Control",
      "query": "(Continuation from query submitted on 9 April 2025)Thank you for your response dated 21.4.2025, which I have noted with appreciation.Regarding the “falsified survey plan,” I confirm that I reported this issue, supported by relevant drawings, to the Sabah Surveyors Board over two years ago. Additionally, I have lodged a complaint with the Board of Architects Malaysia (LAM), which is currently under investigation.I understand that your response is provided as general clarification. In this context, I have one general question: Is the amended development plan typically prepared before or after the completion of the final as-built survey?",
      "reply": ""
    }
  ]
}